(ns sicp.chapter01.ex1-09)

(defn +
  [a b]
  (if (zero? a)
    b
    (inc (+ (dec a) b))))

; (+ 4 5)
; (inc (+ 3 5))
; (inc (inc (+ 2 5)))
; (inc (inc (inc (+ 1 5))))
; (inc (inc (inc (inc (+ 0 5)))))
; (inc (inc (inc (inc 5)))
; (inc (inc (inc 6))
; (inc (inc 7))
; (inc 8)
; 9
;судя по последоватености отложенных процессов - это рекурсивный процесс
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(defn +
  [a b]
  (if (zero? a)
    b
    (+ (dec a) (inc b))))

; (+ 4 5)
; (+ 3 6)
; (+ 2 7)
; (+ 1 8)
; (+ 0 9)
; 9
;отложенных операций в данном процессе нет: процесс итеративный
